Tekla Open API Reference for Tekla Structures 2025
AnalysisPart.DeleteAnalysisPart Method
 Deletes the analysis part by ID.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool DeleteAnalysisPart()
Public Function DeleteAnalysisPart As Boolean
Return Value
Type: Boolean
True if successful.
See Also
Reference
AnalysisPart Class
Tekla.Structures.Analysis Namespace